/****************************************************************************
* Copyright (c) 2015 - 2016, CEA
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:
* 1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.
* 2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.
* 3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
* IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
* OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
*****************************************************************************/
//////////////////////////////////////////////////////////////////////////////
//
// File:        Navier_Stokes_FT_Disc.cpp
// Directory:   $TRUST_ROOT/../Composants/TrioCFD/Front_tracking_discontinu/src
// Version:     /main/55
//
//////////////////////////////////////////////////////////////////////////////
#include <Parametre_implicite.h>
#include <Navier_Stokes_FT_Disc.h>
#include <Probleme_FT_Disc_gen.h>
#include <Modele_turbulence_hyd_null.h>
#include <Discret_Thyd.h>
#include <Operateur_Diff_base.h>
#include <Transport_Interfaces_FT_Disc.h>
#include <Fluide_Diphasique.h>
#include <Fluide_Incompressible.h>
#include <Assembleur_base.h>
#include <TRUST_Vector.h>
#include <Schema_Temps_base.h>
#include <Domaine_VDF.h>
#include <Debog.h>
#include <Op_Dift_VDF_Face_leaves.h>
// Ces includes seront a retirer quand on aura clairement separe les operations
// specifiques au VDF et VEF
#include <Domaine_VF.h>
#include <Convection_Diffusion_Temperature_FT_Disc.h>
#include <Terme_Source_Constituant_Vortex_VEF_Face.h>
#include <TRUSTTrav.h>
#include <Matrice_Morse_Sym.h>
#include <Matrice_Bloc.h>
#include <Param.h>
#include <Vecteur3.h>
#include <Domaine_Cl_VDF.h>
#if TCL_MODEL
//#include <Dirichlet_paroi_fixe.h>
//#include <Dirichlet_paroi_defilante.h>
//#include <Neumann_sortie_libre.h>
//#include <Periodique.h>
//#include <Symetrie.h>
//#include <Dirichlet.h>
//#include <Dirichlet_homogene.h>
#endif
#define NS_VERBOSE 0 // To activate verbose mode on err ...
// EB
#include <Modele_Collision_FT.h>
#include <Particule_Solide.h>
#include <Matrice_Dense.h>
#include <Matrice_Diagonale.h>
#include <Maillage_FT_Disc.h>
#include <Postraitement_Forces_Interfaces_FT.h>
#include <MD_Vector_tools.h>
#include <EcritureLectureSpecial.h>
#include <Avanc.h>
#include <iostream>
#include <vector>
#include <Statistiques.h>
#include <Connex_components_FT.h>
#include <Connex_components.h>

#include <fstream>
#include <iomanip>
#include <SFichier.h>
#include <EFichier.h>
#include <sys/stat.h>
// fin EB
// #include <chrono>
// using namespace std::chrono;

Implemente_instanciable_sans_constructeur_ni_destructeur(Navier_Stokes_FT_Disc,"Navier_Stokes_FT_Disc",Navier_Stokes_Turbulent);

class Navier_Stokes_FT_Disc_interne
{
public:
  Navier_Stokes_FT_Disc_interne() :
    correction_courbure_ordre_(0), // Par defaut, pas de prise en compte de la courbure pour corriger le champ etendu delta_vitesse
    mpoint_inactif(0),   // Par defaut, mpoint cree un saut de vitesse
    mpointv_inactif(0),   // Par defaut, mpointv  cree un saut de vitesse
    matrice_pression_invariante(0),   // Par defaut, recalculer la matrice pression
    clipping_courbure_interface(1e40),// Par defaut, pas de clipping
    flag_correction_trainee_(0), // EB : Par defaut, pas de correction de trainee
    alpha_correction_trainee_(0.), // EB
    beta_correction_trainee_(0.), // EB
    faces_diphasiques_(1), // EB
    extension_reynolds_(0), // EB
    proportionnel_(0), // EB
    terme_gravite_(GRAVITE_GRAD_I),   // Par defaut terme gravite ft sans courants parasites
    is_explicite(1),                  // Par defaut, calcul explicite de vpoint etape predicition
    is_boussinesq_(0),                // Par defaut, l'hypothese de Boussinesq n'est pas utilisee pour la flottabilite dans les phases.
    new_mass_source_(0),              // Par defaut, on utilise la methode historique pour imposer le saut de vitesse du changement de phase.
    type_interpol_indic_pour_dI_dt_(INTERP_STANDARD), // Default is the historical interpolation
    OutletCorrection_pour_dI_dt_(NO_CORRECTION),   // Default is the historical
    is_penalized(0),                  // Par defaut, pas de penalisation L2 du forcage
    eta(1.0),                         // Par defaut, coefficient de penalisation L2 = 1.
    p_ref_pena(-1.e40),               // Par defaut, pas de penalisation L2 de la pression sinon valeur reference
    is_pfl_flottant(0),               // Traitement local Dirichlet pression si les CL pression sont toutes en Neumann homogene
    x_pfl_imp(-1.e40),                // Par defaut, x, y, z du point de modification de la pression fluide
    y_pfl_imp(-1.e40),
    z_pfl_imp(-1.e40)
  {};
  int correction_courbure_ordre_;
  int mpoint_inactif;
  int mpointv_inactif;

  Champ_Fonc second_membre_projection;
  Champ_Fonc second_membre_projection_jump_;
  Champ_Fonc derivee_u_etoile;
  Champ_Fonc gradient_pression;
  Champ_Fonc terme_diffusion;
  Champ_Fonc terme_convection;
  Champ_Fonc terme_source;
  Champ_Fonc terme_source_interfaces;
  Champ_Fonc indicatrice_p1b;
  Champ_Fonc gradient_indicatrice;
  Champ_Fonc potentiel_faces;
  Champ_Fonc potentiel_elements;
  // delta_u_interface = la partie "saut de vitesse" du champ de vitesse a l'interface
  Champ_Inc delta_u_interface;
  Champ_Fonc laplacien_d;
  Champ_Fonc mpoint;
  Champ_Fonc mpoint_vap;
  // Variation temporelle indicatrice de phase
  Champ_Fonc derivee_temporelle_indicatrice;
  Champ_Fonc ai; // Eulerian interfacial area.
  Champ_Inc vitesse_jump0_; // Extended Velocity of phase 0.
  Champ_Fonc terme_source_collisions; // HMS
  Champ_Fonc  num_compo; // HMS
  Champ_Fonc vitesse_stokes_th_; // EB
  Champ_Fonc pression_stokes_th_; // EB
  Champ_Fonc terme_correction_trainee; // EB
  LIST(REF(Champ_base)) liste_champs_compris;

  // Si matrice_pression_invariante != 0,
  //   on ne recalcule pas la matrice de pression a chaque pas de temps.
  int matrice_pression_invariante;
  // Si on veut ajouter une interface a vitesse imposee :
  //  reference a l'equation de transport correspondante :
  VECT(REF(Transport_Interfaces_FT_Disc)) ref_eq_interf_vitesse_imposee;
  // Si le fluide est diphasique, c'est l'indicatrice de l'equation suivante
  // qui est utilisee pour determiner les proprietes du fluide:
  // (masse volumique, viscosite, tension superficielle, ...)
  REF(Transport_Interfaces_FT_Disc) ref_eq_interf_proprietes_fluide;
  // Si le fluide est diphasique, la reference au fluide:
  REF(Fluide_Diphasique) ref_fluide_diphasique;

  REF(Convection_Diffusion_Temperature_FT_Disc) ref_equation_mpoint_;
  REF(Convection_Diffusion_Temperature_FT_Disc) ref_equation_mpoint_vap_;

  // Valeur maximale de courbure autorisee pour calculer le
  // terme source de tension de surface (clipping si valeur superieur)
  double clipping_courbure_interface;

  int flag_correction_trainee_; // EB
  double alpha_correction_trainee_; // EB
  double beta_correction_trainee_; // EB
  int faces_diphasiques_; // EB
  int extension_reynolds_; // EB
  int proportionnel_; // EB

  //-----------
  //enum Modele_collisions { RESSORT_AMORTI_VVA, RESSORT_AMORTI_ESI, RESSORT_AMORTI_EE, MOHAGHEG,HYBRID_EE, HYBRID_ESI, HYBRID_RK3, HYBRID_VVA, BREUGEM };
  //Modele_collisions modele_collisions;
  //-----------
  enum Terme_Gravite { GRAVITE_RHO_G, GRAVITE_GRAD_I };
  Terme_Gravite terme_gravite_;
  Noms equations_concentration_source_fluide_;
  // Si is_explicite != 0,
  //   on calcul vpoint de facon explicite dans l etape de prediction des vitesses.
  int is_explicite;
  // Si is_boussinesq_ != 0, on calcul une force par le modele de boussinesq
  int is_boussinesq_;
  // Flag pour la method du saut de vitesse :
  int new_mass_source_;

  enum Type_interpol_indic_pour_dI_dt { INTERP_STANDARD, INTERP_MODIFIEE, INTERP_AI_BASED,
                                        INTERP_STANDARD_UVEXT, INTERP_MODIFIEE_UVEXT, INTERP_AI_BASED_UVEXT,
                                        INTERP_STANDARD_UIEXT, INTERP_MODIFIEE_UIEXT, INTERP_AI_BASED_UIEXT
                                      };
  Type_interpol_indic_pour_dI_dt type_interpol_indic_pour_dI_dt_;

  enum OutletCorrection_pour_dI_dt { NO_CORRECTION, CORRECTION_GHOST_INDIC, ZERO_NET_FLUX_ON_MIXED_CELLS, ZERO_OUT_FLUX_ON_MIXED_CELLS };
  OutletCorrection_pour_dI_dt OutletCorrection_pour_dI_dt_;

  // Si is_penalized != 0,
  //   on penalise L2 le terme de forcage.
  int is_penalized;
  // Valeur de l'inverse du coefficient de penalisation L2 du terme de forcage.
  double eta;
  // Valeur pour la penalisation L2 de la pression.
  double p_ref_pena;
  // Point de penalisation L2 de la pression du fluide
  int is_pfl_flottant; // Traitement local Dirichlet pression si les CL pression sont toutes en Neumann homogene
  double x_pfl_imp;
  double y_pfl_imp;
  double z_pfl_imp;

  DoubleTab force_pression_interf_; // EB pression locale pour chaque fa7
  DoubleTab force_frottements_interf_; // EB force de frottement locale pour chaque fa7
  DoubleTab pression_interf_; // EB pression a l'interface locale pour chaque fa7
  DoubleVect surface_tot_interf_; // EB
  DoubleTab force_pression_tot_interf_; // EB
  DoubleTab force_frottements_tot_interf_; // EB
  DoubleTab force_pression_tot_interf_stokes_th_; // EB
  DoubleTab force_frottements_tot_interf_stokes_th_; // EB
  DoubleTab force_pression_tot_interf_stokes_th_dis_; // EB
  DoubleTab force_frottements_tot_interf_stokes_th_dis_; // EB


  DoubleTab sigma_xx_interf_, sigma_xy_interf_, sigma_xz_interf_, sigma_yx_interf_, sigma_yy_interf_, sigma_yz_interf_, sigma_zx_interf_, sigma_zy_interf_, sigma_zz_interf_; // EB tenseur des contraintes local pour c
  DoubleTab sigma_xx_interf_stokes_th_dis_, sigma_xy_interf_stokes_th_dis_, sigma_xz_interf_stokes_th_dis_, sigma_yx_interf_stokes_th_dis_, sigma_yy_interf_stokes_th_dis_, sigma_yz_interf_stokes_th_dis_, sigma_zx_interf_stokes_th_dis_, sigma_zy_interf_stokes_th_dis_, sigma_zz_interf_stokes_th_dis_; // EB tenseur des contraintes local pour c

  DoubleTab sigma_xx_interf_stokes_th_, sigma_xy_interf_stokes_th_, sigma_xz_interf_stokes_th_, sigma_yy_interf_stokes_th_, sigma_yz_interf_stokes_th_, sigma_zz_interf_stokes_th_;
  DoubleTab dUdx_P1_, dUdy_P1_, dUdz_P1_, dVdx_P1_, dVdy_P1_, dVdz_P1_, dWdx_P1_, dWdy_P1_, dWdz_P1_;
